InformationRegisters/ТелефонныеКодаОператоровСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ТелефонныеКодаОператоровСвязи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтранаМира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОператорСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОператоровСвязи</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторГородов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КлассификаторГородов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>КлассификаторГородов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КлассификаторСтранМира</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КраткийСоставСпарвочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Comment>Краткое наименование, без типа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыГородов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТелефонныеКода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторОператоровСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>КлассификаторОператоровСвязи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КлассификаторСтранМира</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КраткийСоставСпарвочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТелефонныеКода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторСтранМира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>КлассификаторСтранМира</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КраткийСоставСпарвочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТелефонныеКода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ТелефонныеКодаОператоровСвязи/Ext/ManagerModule.bsl
Процедура СформироватьТелефонныеКода(Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Выборка.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СтраныМира.Код КАК Поле1,
	                      |	ОператорыСвязи.Поле2 КАК Поле2,
	                      |	СтраныМира.Ссылка КАК СтранаМира,
	                      |	ОператорыСвязи.ОператорСвязи КАК ОператорСвязи
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		КлассификаторГородовТелефонныеКода.Код КАК Поле2,
	                      |		КлассификаторГородовТелефонныеКода.Ссылка КАК ОператорСвязи,
	                      |		КлассификаторГородовТелефонныеКода.Ссылка.Владелец КАК СтранаМира
	                      |	ИЗ
	                      |		Справочник.КлассификаторГородов.ТелефонныеКода КАК КлассификаторГородовТелефонныеКода
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		КлассификаторОператоровСвязиТелефонныеКода.Код,
	                      |		КлассификаторОператоровСвязиТелефонныеКода.Ссылка,
	                      |		КлассификаторОператоровСвязиТелефонныеКода.Ссылка.Владелец
	                      |	ИЗ
	                      |		Справочник.КлассификаторОператоровСвязи.ТелефонныеКода КАК КлассификаторОператоровСвязиТелефонныеКода) КАК ОператорыСвязи
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира.ТелефонныеКода КАК СтраныМира
	                      |		ПО ОператорыСвязи.СтранаМира = СтраныМира.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	NULL,
	                      |	ОператорыСвязи.Поле2,
	                      |	ОператорыСвязи.СтранаМира,
	                      |	ОператорыСвязи.ОператорСвязи
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		КлассификаторГородовТелефонныеКода.Код КАК Поле2,
	                      |		КлассификаторГородовТелефонныеКода.Ссылка КАК ОператорСвязи,
	                      |		КлассификаторГородовТелефонныеКода.Ссылка.Владелец КАК СтранаМира
	                      |	ИЗ
	                      |		Справочник.КлассификаторГородов.ТелефонныеКода КАК КлассификаторГородовТелефонныеКода
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		КлассификаторОператоровСвязиТелефонныеКода.Код,
	                      |		КлассификаторОператоровСвязиТелефонныеКода.Ссылка,
	                      |		КлассификаторОператоровСвязиТелефонныеКода.Ссылка.Владелец
	                      |	ИЗ
	                      |		Справочник.КлассификаторОператоровСвязи.ТелефонныеКода КАК КлассификаторОператоровСвязиТелефонныеКода) КАК ОператорыСвязи
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	                      |		ПО ОператорыСвязи.СтранаМира = Константы.ОсновнойГород.Владелец
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	NULL,
	                      |	NULL,
	                      |	Константы.ОсновнойГород.Владелец,
	                      |	Константы.ОсновнойГород
	                      |ИЗ
	                      |	Константы КАК Константы
	                      |ГДЕ
	                      |	(НЕ Константы.ОсновнойГород = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка))
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Поле1,
	                      |	Поле2");
				   
	НаборЗаписей = СоздатьНаборЗаписей();			   
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Отказ = Истина;
		// TODO: Сообщение об ошибке.
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);
	
КонецПроцедуры // СформироватьТелефонныеКода()
